Тест1/src/InformationRegisters/ПоказателиЗП/ПоказателиЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиЗП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Аванс</name>
    <comment>Официальный аванс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подсчёт</name>
    <comment>Неофициальный аванс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ООклад</name>
    <comment>Официальный оклад</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НОклад</name>
    <comment>Неофициальный оклад</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НАванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДогАванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НПодсчёт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/InformationRegisters/ПоказателиЗП/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура Расчёт()
	Если Запись.ООклад < Запись.Оклад  тогда
		Запись.НОклад = Запись.Оклад - Запись.ООклад;
	иначе
		//Сообщить("Введите верные данные!");
	КонецЕсли;
	
	Запись.Аванс    = Запись.ООклад   *0.4;
	Запись.Подсчёт  = Запись.ООклад   - запись.Аванс;
	Запись.НАванс   = Запись.ДогАванс - запись.Аванс;
	Запись.НПодсчёт = Запись.НОклад   - запись.НАванс;	
	
	Запись.Оклад   = Запись.ООклад + запись.НОклад;
	
	Если  Запись.НАванс + запись.Аванс > Запись.ДогАванс Тогда
		Сообщить("Недостаточный аванс для оклада");
		Запись.ДогАванс = Запись.НАванс + запись.Аванс;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкладПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ООкладПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ОкладОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	//Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ДогАвансПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры
